{"cf_tracking_thunderbird_esr52": "---", "cf_tracking_firefox60": "---", "cf_tracking_firefox61": "---", "cf_tracking_firefox62": "---", "creator": "mcastelluccio@mozilla.com", "mentors_detail": [], "depends_on": [], "cf_status_firefox_esr60": "---", "cf_user_story": "", "cf_tracking_firefox_relnote": "---", "platform": "Unspecified", "keywords": [], "cc_detail": [{"email": "andrei.vaida@softvision.ro", "id": 488993, "name": "andrei.vaida@softvision.ro", "real_name": "Andrei Vaida [:avaida] – please ni? me"}, {"email": "cristian.baica@softvision.ro", "id": 614785, "name": "cristian.baica@softvision.ro", "real_name": "Cristian Baica [:cbaica], Release Desktop QA"}, {"email": "florian@queze.net", "id": 149052, "name": "florian@queze.net", "real_name": "Florian Quèze [:florian]"}, {"email": "gijskruitbosch+bugs@gmail.com", "id": 159069, "name": "gijskruitbosch+bugs@gmail.com", "real_name": ":Gijs (he/him)"}, {"email": "igoldan@mozilla.com", "id": 590618, "name": "igoldan@mozilla.com", "real_name": "Ionuț Goldan [:igoldan], Performance Sheriffing"}, {"email": "jmaher@mozilla.com", "id": 324370, "name": "jmaher@mozilla.com", "real_name": "Joel Maher ( :jmaher ) (UTC-4)"}, {"email": "madperson@gmx.at", "id": 209011, "name": "madperson@gmx.at", "real_name": "[:philipp]"}, {"email": "mayankleoboy1@gmail.com", "id": 440227, "name": "mayankleoboy1@gmail.com", "real_name": "Mayank Bansal"}, {"email": "paolo.mozmail@amadzone.org", "id": 332229, "name": "paolo.mozmail@amadzone.org", "real_name": ":Paolo Amadini"}, {"email": "past@mozilla.com", "id": 363318, "name": "past@mozilla.com", "real_name": "Panos Astithas [:past] (please ni?)"}, {"email": "rtestard@mozilla.com", "id": 486264, "name": "rtestard@mozilla.com", "real_name": "Romain Testard [:RT]"}, {"email": "rwood@mozilla.com", "id": 447387, "name": "rwood@mozilla.com", "real_name": "Robert Wood [:rwood]"}, {"email": "sledru@mozilla.com", "id": 495955, "name": "sledru@mozilla.com", "real_name": "Sylvestre Ledru [:sylvestre]"}, {"email": "tgrabowski@mozilla.com", "id": 600289, "name": "tgrabowski@mozilla.com", "real_name": "Tom Grabowski [:TomGrab]"}], "cf_last_resolved": null, "attachments": [], "votes": 0, "classification": "Components", "is_confirmed": true, "is_creator_accessible": true, "cf_has_regression_range": "---", "comment_count": 34, "comments": [{"text": "A large number of users have antiviruses installed. They often slow down I/O.\nIt might be worth profiling our startup (and maybe other key interactions) on a machine with an antivirus installed.\n\nWe have stats on the most used antiviruses, so we could profile Firefox with those. E.g. Avast, IIRC the most commonly used one, is installed for ~14% of users.", "author": "mcastelluccio@mozilla.com", "id": 13043462, "time": "2018-02-15T00:52:27Z"}, {"text": "I believe Florian is already doing it?", "author": "past@mozilla.com", "id": 13079995, "time": "2018-03-01T17:00:23Z"}, {"text": "(In reply to Panos Astithas [:past] (please ni?) from comment #1)\n> I believe Florian is already doing it?\n\nI think this bug was filed as a result of me pointing out that Kaspersky was dramatically slowing down content process startup on a machine where I profiled. If I understand correctly, the idea of this bug is to profile with various all the common antiviruses that our users have; I haven't done this. Sounds like a good idea but I'm not sure who should be doing it. Maybe QA?", "author": "florian@queze.net", "id": 13080073, "time": "2018-03-01T17:15:51Z"}, {"text": "Is there a list of OS/config and AntiVirus software we should test with on a first pass?\n\nI imagine we would test startup and pageload tests from talos, run manually probably on a windows 10 reference laptop or some similar spec mass production hardware.\n\nOnce we have a clear list of what we want to do, we can figure out who can do it and start getting results.  Ideally we can find a solution for doing this in automation.  AV software makes that difficult- possibly there are good solutions that can work well in automation.", "author": "jmaher@mozilla.com", "id": 13115286, "time": "2018-03-08T21:38:14Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #3)\n> Is there a list of OS/config and AntiVirus software we should test with on a\n> first pass?\n\nMarco, could you provide the stats you hinted at in comment 0?", "author": "past@mozilla.com", "id": 13129503, "time": "2018-03-14T22:46:47Z"}, {"text": "I have some out of date stats, I could regenerate them. But maybe Romain already has something up to date.", "author": "mcastelluccio@mozilla.com", "id": 13133122, "time": "2018-03-16T10:30:49Z"}, {"text": "I looked at the 64 bit DLLs for Windows 10/7/8.1 that were not from Microsoft, did not have hardware dependencies and impacted over 2% of the Windows 10/7/8.1 64 bit user base. This was mostly to identify which 3rd party softwares should be manually tested - the DLL identification process was fairly manual so prone to error.\nThe list can be accessed here (this data is 4 months old): https://docs.google.com/document/d/1qYkWOOO2zGfq2RlnnDqi7cyUx3pq0fM7kCz7uN2lRqM/edit", "author": "rtestard@mozilla.com", "id": 13133321, "time": "2018-03-16T12:24:35Z"}, {"text": "it looks like:\n* Avast Anti Virus: https://www.avast.com/en-us/free-antivirus-download\n* Kaspersky Anti-Virus: https://usa.kaspersky.com/downloads/thank-you/antivirus-free-trial\n* ESET Anti virus: https://www.eset.com/us/home/free-trial/?CMP=knc-Google-G_S-US-BR-C-Antivirus_B&gkw=eset%20antivirus%20trial&gcr=181305559630&gcp744383276&gag=39591760756&gpl=&gclid=EAIaIQobChMIxu20i__w2QIVmoqzCh2rLwp4EAAYASAAEgLIuPD_BwE&gclsrc=aw.ds\n* Symantec CMC Firewall: https://us.norton.com/downloads\n\nthese entries appear to be apps from other companies that are not anti-virus/malware\nBonjour\nSogou.com Inc\nJava(TM) Platform SE\n\n\nI assume we have versions of this internally we can download that are fully licensed (or does a trial work out ok)?  do we have recommendations for settings on these?  default settings maybe?  \n\n:rt, can you help confirm my understanding of this and help direct what we should be testing?", "author": "jmaher@mozilla.com", "id": 13133530, "time": "2018-03-16T13:57:37Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #7)\n> it looks like:\n> * Avast Anti Virus: https://www.avast.com/en-us/free-antivirus-download\n> * Kaspersky Anti-Virus:\n> https://usa.kaspersky.com/downloads/thank-you/antivirus-free-trial\n> * ESET Anti virus:\n> https://www.eset.com/us/home/free-trial/?CMP=knc-Google-G_S-US-BR-C-\n> Antivirus_B&gkw=eset%20antivirus%20trial&gcr=181305559630&gcp744383276&gag=39\n> 591760756&gpl=&gclid=EAIaIQobChMIxu20i__w2QIVmoqzCh2rLwp4EAAYASAAEgLIuPD_BwE&\n> gclsrc=aw.ds\n> * Symantec CMC Firewall: https://us.norton.com/downloads\n> \n> these entries appear to be apps from other companies that are not\n> anti-virus/malware\n> Bonjour\n> Sogou.com Inc\n> Java(TM) Platform SE\n> \nThat's right although it may still impact startup time.\n> \n> I assume we have versions of this internally we can download that are fully\n> licensed (or does a trial work out ok)?  do we have recommendations for\n> settings on these?  default settings maybe?  \nI contacted Avast in the past and they advised using the free version since the vast majority of Avast usage is on their free version.\nI'd assume the same for Kaspersky, ESET and Symantec although perhaps we could test that the free versions indeed load the reported DLLs?\n\nFor info Su is helping me get a report of how DLLs injected correlate to retention. I hope this can help prioritize software testing by looking at the combinations of frequency of occurences of DLLs and how this correlates to retention.", "author": "rtestard@mozilla.com", "id": 13133887, "time": "2018-03-16T15:41:21Z"}, {"text": "Bonjour is apple itunes\n\n:igoldan, next week can you start running ts_paint locally with:\n* baseline (x5)\n* for each of the above programs, install, run ts_paint x5, get data saved off, uninstall", "author": "jmaher@mozilla.com", "id": 13133964, "time": "2018-03-16T16:05:24Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #9)\n> Bonjour is apple itunes\n> \n> :igoldan, next week can you start running ts_paint locally with:\n> * baseline (x5)\n> * for each of the above programs, install, run ts_paint x5, get data saved\n> off, uninstall\n\nYes, will do this after I get my hands on a laptop from the workplace.\nI understand I'll test against Avast, Kaspersky, ESET and Symantec.\n\nFor the other apps you mentioned, are these the right places from which I can download them?\nBonjour: https://support.apple.com/kb/DL999?locale=en_US&viewlocale=en_US\nJava(TM) Platform SE: download.oracle.com/otn-pub/java/jdk/9.0.4+11/c2514751926b4512b076cc82f959763f/jdk-9.0.4_windows-x64_bin.exe\n\nI don't know where I can download the last one, Sogou.com Inc. Please share the appropriate for this app.", "author": "igoldan@mozilla.com", "id": 13142654, "time": "2018-03-20T14:54:00Z"}, {"text": "Sogou.com seems to be a Chinese language search engine- I spent 15 minutes trying to figure out what would be installed and I couldn't find anything obvious to install.  If others have ideas here, speak up!\n\nRegarding Java, I think there needs to be an app that uses the jdk for it to be running in the background.\n\nThanks for picking this up Ionut!", "author": "jmaher@mozilla.com", "id": 13142714, "time": "2018-03-20T15:15:12Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #11)\n> Sogou.com seems to be a Chinese language search engine- I spent 15 minutes\n> trying to figure out what would be installed and I couldn't find anything\n> obvious to install.  If others have ideas here, speak up!\n\nhttps://en.wikipedia.org/wiki/Sogou_Pinyin", "author": "florian@queze.net", "id": 13143906, "time": "2018-03-20T21:51:25Z"}, {"text": "I will be using Windows 10 x64. Does this suffice?\nAlso, if you have some specific hardware preferences regarding the laptop, please tell.", "author": "igoldan@mozilla.com", "id": 13144879, "time": "2018-03-21T09:57:08Z"}, {"text": "(In reply to Ionuț Goldan [:igoldan], Performance Sheriffing from comment #13)\n> I will be using Windows 10 x64. Does this suffice?\n> Also, if you have some specific hardware preferences regarding the laptop,\n> please tell.\n\nThis shows the user distribution per OS, per OS arch: https://sql.telemetry.mozilla.org/queries/49731/source#133820\n77% of users are covered by the top 3: 64 bit Win10, 64 bit Win7 and 32 bit Win7\n\nThe list I provided only looked at 64 bit DLLs so I'd suggest focussing on 64 bit Win10 and 64 bit Win7 sinec the share of Win7 is still fairly high.\n\nRegarding SoGou, 2 DLLs from this editor came-up in the top DLLs: PicFace64.dll and SOGOUPY.IME.\nSimilarly to Comment 12, all descriptions I found on these seem to point to Sogou Pinyin input method (https://pinyin.sogou.com/mac/).", "author": "rtestard@mozilla.com", "id": 13145028, "time": "2018-03-21T10:48:34Z"}, {"text": "I tried to install Sogou using:\nhttp://cdn2.ime.sogou.com/836c2ad141067487bff5c61e22978726/5ab2bbec/dl/index/1520568503/sogou_pinyin_89c.exe\n\nunfortunately my network provider blocks access to that file- I believe that install will get us the Pinyin IM.", "author": "jmaher@mozilla.com", "id": 13147944, "time": "2018-03-22T10:28:49Z"}, {"text": "Would it be OK if I use a Firefox artifact for doing my tests? That is: pick a recent mozilla-central changeset, then build Firefox in artifact mode.", "author": "igoldan@mozilla.com", "id": 13158323, "time": "2018-03-27T10:50:59Z"}, {"text": "(In reply to Ionuț Goldan [:igoldan], Performance Sheriffing from comment #16)\n> Would it be OK if I use a Firefox artifact for doing my tests? That is: pick\n> a recent mozilla-central changeset, then build Firefox in artifact mode.\n\nWhat's the benefit of using an artifact build compared to an official nightly build? I would expect this startup profiling to happen on a machine that looks more like a user machine than like a developer machine, so I wouldn't expect for example visual studio.", "author": "florian@queze.net", "id": 13158419, "time": "2018-03-27T11:41:21Z"}, {"text": "(In reply to Florian Quèze [:florian] from comment #17)\n> (In reply to Ionuț Goldan [:igoldan], Performance Sheriffing from comment\n> #16)\n> > Would it be OK if I use a Firefox artifact for doing my tests? That is: pick\n> > a recent mozilla-central changeset, then build Firefox in artifact mode.\n> \n> What's the benefit of using an artifact build compared to an official\n> nightly build? I would expect this startup profiling to happen on a machine\n> that looks more like a user machine than like a developer machine, so I\n> wouldn't expect for example visual studio.\n\nI will configure the tests to use the nightly build.\nBut I cannot uninstall Visual Studio, as it is an important dependency for our Windows tooling. Without it, I won't be able to run my perf tests.", "author": "igoldan@mozilla.com", "id": 13162525, "time": "2018-03-28T07:55:27Z"}, {"text": "Regarding testing alongside Java: I'm downloading the JRE and keeping Virtualbox running, to respect :jmaher's indication from comment 11.\nIf you have other opinions, please share them here.", "author": "igoldan@mozilla.com", "id": 13162529, "time": "2018-03-28T07:56:23Z"}, {"text": "For installing Sogou Pinyin, would this link do: http://qpdownload.com/sogou-pinyin/ ?", "author": "igoldan@mozilla.com", "id": 13162591, "time": "2018-03-28T08:31:10Z"}, {"text": "(In reply to Ionuț Goldan [:igoldan], Performance Sheriffing from comment #18)\n\n> But I cannot uninstall Visual Studio, as it is an important dependency for\n> our Windows tooling. Without it, I won't be able to run my perf tests.\n\nWhich tooling and perf tests are you considering? It's possible we have understood this bug differently. I was expecting a machine in a 'user' configuration, and Firefox started with the MOZ_PROFILER_STARTUP environment variable, and then the startup profile captured and uploaded. Preferably with the machine rebooted each time, to capture cold startup.", "author": "florian@queze.net", "id": 13162603, "time": "2018-03-28T08:39:43Z"}, {"text": "I think we had a lack of communication in the bug.  In comment 3 I had mentioned running ts_paint from talos with different anti-virus programs installed.\n\n:florian, could you outline what is really desired here?  I think there might be a lot of things that both Ionut and myself are not familiar with in your request, so the more detailed the steps the easier it is to do it right.", "author": "jmaher@mozilla.com", "id": 13162618, "time": "2018-03-28T08:46:15Z"}, {"text": "(In reply to Florian Quèze [:florian] from comment #21)\n> (In reply to Ionuț Goldan [:igoldan], Performance Sheriffing from comment\n> #18)\n> \n> > But I cannot uninstall Visual Studio, as it is an important dependency for\n> > our Windows tooling. Without it, I won't be able to run my perf tests.\n> \n> Which tooling and perf tests are you considering? It's possible we have\n> understood this bug differently. I was expecting a machine in a 'user'\n> configuration, and Firefox started with the MOZ_PROFILER_STARTUP environment\n> variable, and then the startup profile captured and uploaded. Preferably\n> with the machine rebooted each time, to capture cold startup.\n\nI'm using the steps listed by :jmaher in comment 9. Those steps expect me to prepare a local development environment, as showed here [1]. I'm then running the tests from inside the start-shell.bat terminal emulator. That's how Talos is able run the ts_paint test and gather the timestamps.\n\n[1] https://developer.mozilla.org/en-US/docs/Mozilla/Developer_guide/Build_Instructions/Windows_Prerequisites", "author": "igoldan@mozilla.com", "id": 13162625, "time": "2018-03-28T08:49:53Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #22)\n> I think we had a lack of communication in the bug.  In comment 3 I had\n> mentioned running ts_paint from talos with different anti-virus programs\n> installed.\n\nIndeed, when you said \"test startup and pageload tests from talos, run manually\" in comment 3 I wrongly assumed you meant \"do the same thing as what talos do in these tests but by hand\", so I didn't notice we had something different in mind.\n\nWhat I was expecting is something roughly like:\n\nInitial setup:\n- have a clean Windows 10 machine.\n- Install on it the latest Firefox nightly.\n- Install the gecko profiler add-on.\n- Create a .bat script on the desktop that can easily start Nightly with the environment variables to profile startup (that's MOZ_PROFILER_STARTUP=1 and MOZ_PROFILER_STARTUP_ENTRIES=<large value>).\n\nPreparation for a run:\n- reboot the computer,\n- wait for everything to settle (eg. using the task manager, wait for the disk and CPU usage to be low). This may take several seconds to several hours depending on what happens. I once saw Windows Update and Windows Defender doing a background scan of my reference hardware's disk for almost a whole day, making any performance testing impossible on that machine for the whole day.\n\nActually running it:\n- click the .bat script to open Nightly,\n- once it's done starting, press ctrl+shift+2 to open the profiler UI.\n- Wait for symbolication to complete, and then click \"Share\". Save the link.\nIf we want to have numbers in addition to the profile, open about:telemetry, click \"Simple Measurements\" and copy relevant values from there. Relevant values would include at least firstPaint, delayedStartupStarted, delayedStartupFinished, sessionRestored.\n\nI would expect this data to be noisy, so I would probably take a couple runs. Maybe 5. It's important to reboot the computer each time if we want to measure cold startup. If you want to measure warm startup (and be closer to the numbers we have on Talos), run this a couple times in a row without rebooting.\n\n\nThis is to give a baseline for the machine we are going to use. Now to test with third party software, I would install it, reboot the computer, and run the same tests.\n\nI have very little trust for the 'uninstall' feature of antivirus software. So if we are testing using physical hardware, I would ensure we have a system restore point right before installing the third party software, and after we are done testing, I would use system restore to go back to the clean state. If we are using virtual machines instead of physical hardware, I would just snapshot the VM before installing the third party software.\n\nIf we are using virtual machines and have enough disk space on the host hardware, it would be nice to keep a snapshot or a copy of the VM with each of the third party software installed. I would assume these things are tedious/slow to install, and if we want to repeat the tests in the future, we would like to avoid spending the same time again doing the setup.\n\n\nSo, this is what I had in mind... and I now imagine you were thinking of something very different. I think it all goes down to which question we are trying to answer. As an engineer I would like to know what's slow in what our users experience. So numbers aren't giving enough information. I also doubt our current talos tests match what our users experience. The most recent example being ts_paint that got a 50+% win on Linux but nothing on Windows with bug 1447719 comment 9. Telemetry says that Windows users experienced the win too: https://mzl.la/2urbSDA I'm also more interested in cold startup than warm startup, because while warm startup is less noisy, it's also much more artificial.\n\nIf the question you are trying to answer is which antivirus is affecting us the most right now, and be able to repeat this test in the future to catch regressions in future versions of antiviruses, you want something more automated and easy to repeat to produce numbers, so running Talos makes more sense than what I'm suggesting.\n\nI can't say for sure what Marco had in mind when filing the bug, so you probably want to ask him too. I had just assumed that \"profile startup\" meant \"use the gecko profiler\", because that's what I've been doing for months ;-).", "author": "florian@queze.net", "id": 13162892, "time": "2018-03-28T11:03:34Z"}, {"text": "> I can't say for sure what Marco had in mind when filing the bug, so you probably want to ask him too. I had just assumed that > \"profile startup\" meant \"use the gecko profiler\", because that's what I've been doing for months ;-).\n\nMarco, can you be explicit about the question we're trying to answer here?", "author": "igoldan@mozilla.com", "id": 13162919, "time": "2018-03-28T11:15:35Z"}, {"text": ":florian Thank you for providing the description of the test setup. I talked with Florin Mezei and concluded this sounds more like a ProductIntegrity (PI) Request, which can be handled by dedicated QA. So, if we are taking your approach and avoid Talos, that's the right thing to do.\n\nFrom the perf side, we can only provide you with the results that Talos returns.", "author": "igoldan@mozilla.com", "id": 13162997, "time": "2018-03-28T11:50:40Z"}, {"text": "What I meant by \"profile startup\" was to actually use the Gecko profiler to analyze the startup performance, like Florian described.", "author": "mcastelluccio@mozilla.com", "id": 13171438, "time": "2018-04-01T20:28:48Z"}, {"text": "Tom- this is a request for manual QA, not running automated tests in a custom environment like I originally thought, can you pick this up?", "author": "jmaher@mozilla.com", "id": 13178790, "time": "2018-04-04T08:49:28Z"}, {"text": "Clearing NI since I believe Florian addressed it.", "author": "rtestard@mozilla.com", "id": 13179428, "time": "2018-04-04T13:14:24Z"}, {"text": "(In reply to Joel Maher ( :jmaher) (UTC-5) from comment #28)\n> Tom- this is a request for manual QA, not running automated tests in a\n> custom environment like I originally thought, can you pick this up?\n\nAndrei Vaida's team is working on it. It will take some time to set up the testing environment. Given the last-minute nature of this request and that we are currently working on many other high-priority tasks, we currently estimate it will take one to two weeks to finish testing.", "author": "tgrabowski@mozilla.com", "id": 13186912, "time": "2018-04-06T17:00:16Z"}, {"text": "I have tested this as instructed. The final results can be found in the following document:\nhttps://docs.google.com/document/d/1ILBhSWrW7upTfkeUma7FlugrLiet1HSZVm25hMghrX0\n\nA spreadsheet containing all the averages can be viewed here:\nhttps://docs.google.com/spreadsheets/d/1zIectmhfUrAxkYjs5G6D0QgeYO3NhQ6j4olW-xnVYU4/", "author": "cristian.baica@softvision.ro", "id": 13234487, "time": "2018-04-26T06:18:36Z"}, {"text": "(In reply to Cristian from comment #31)\n\n> A spreadsheet containing all the averages can be viewed here:\n> https://docs.google.com/spreadsheets/d/1zIectmhfUrAxkYjs5G6D0QgeYO3NhQ6j4olW-\n> xnVYU4/\n\nThe charts in this spreadsheet is a little surprising because it shows Norton faster than baseline on Windows 7 and Avast faster than baseline on Windows 10.\n\nFor Norton on Win7, it's easy to explain: there's a warm startup profile in the list of cold startups, which skews the results.\nFor Avast on Win10, I have no obvious explanation, so I'll just say that I/O timing is a random, and that we would need many more samples to have numbers we can reliably compare.", "author": "florian@queze.net", "id": 13238584, "time": "2018-04-27T16:13:44Z"}, {"text": "(In reply to Cristian from comment #31)\n> I have tested this as instructed. The final results can be found in the\n> following document:\n> https://docs.google.com/document/d/\n> 1ILBhSWrW7upTfkeUma7FlugrLiet1HSZVm25hMghrX0\n\nThanks! There are lots of interesting things we can observe from this data :-).\n\n- some of these startups are pathologically slow - the worst one taking 46s to complete. The difference between baseline and with antivirus installed is the most notable on Windows 7 cold startups, and not really notable on Windows 10.\n\n- on Win7, creating the font list is super expensive (about 5s for cold startup on the baseline), and up to 3 times more expensive (~15s) in with some antiviruses. Which seems to confirm AVs make slow I/O even slower... and that we should find a way to avoid creating that list of fonts to display the early blank window (I saw profiles where this delays the blank window by 15s).\n\n- I saw 2 profiles where there's third party libraries (likely from the AV) doing slow stuff very early during our startup profiles, when we set our crash reporter hooks.\nhttps://perfht.ml/2F9bPfP (an ESET cold startup win7 profile), where we spend 11s in eOppMonitor.dll\nhttps://perfht.ml/2JbQQLS (an Avast cold startup win7 profile), where we spend 1s in snxhk64.dll\nThis is probably not directly actionable, but it may be interesting to add a telemetry probe there to get more data about how long it takes us to register our crash reporting hook and correlate to injected third party libraries.\n\n- content process creation doesn't seem unusually slow. So maybe the extreme slowness I saw there on my mother's laptop (bug 1348361 comment 52) was due to an *old* version of Kaspersky rather than the current one.\n\n- none of the profiles include the GPU process creation. Most likely explanation is that we disable graphic acceleration when we are running in a VM.\n\n- I _think_ (not fully sure) the Kaspersky profiles have jank near the end of startup due to some add-on. See for example https://perfht.ml/2Fq0sk0 from the first Windows 10 cold startup profile with Kaspersky.\n\n- not really a surprise, but we miss a big part of early startup before the profiler starts. Would be nice to re-run similar tests if/once we fix the startup profiling to start earlier.\n\n- I think these profiles are worth looking at individually, especially the cold startup ones, but that's A LOT of profiles (100). Maybe they would be good material to run a session in SF to train people to look at profiles. Giving each participant a new profile that hasn't been studied yet and asking them to identify issues.", "author": "florian@queze.net", "id": 13238628, "time": "2018-04-27T16:31:02Z"}], "id": 1438385, "priority": "P3", "cc": ["andrei.vaida@softvision.ro", "cristian.baica@softvision.ro", "florian@queze.net", "gijskruitbosch+bugs@gmail.com", "igoldan@mozilla.com", "jmaher@mozilla.com", "madperson@gmx.at", "mayankleoboy1@gmail.com", "paolo.mozmail@amadzone.org", "past@mozilla.com", "rtestard@mozilla.com", "rwood@mozilla.com", "sledru@mozilla.com", "tgrabowski@mozilla.com"], "cf_crash_signature": "", "version": "Trunk", "is_cc_accessible": true, "cf_tracking_firefox_esr52": "---", "see_also": [], "cf_tracking_thunderbird_esr60": "---", "status": "NEW", "product": "Toolkit", "cf_fx_iteration": "---", "blocks": [], "qa_contact": "", "creation_time": "2018-02-15T00:52:27Z", "cf_status_firefox_esr52": "---", "component": "Startup and Profile System", "assigned_to_detail": {"email": "nobody@mozilla.org", "id": 1, "name": "nobody@mozilla.org", "real_name": "Nobody; OK to take it and work on it"}, "cf_tracking_firefox_esr60": "---", "cf_status_firefox62": "---", "cf_status_firefox61": "---", "cf_status_firefox60": "affected", "target_milestone": "---", "cf_rank": null, "cf_qa_whiteboard": "", "severity": "normal", "groups": [], "cf_status_thunderbird_esr52": "---", "url": "", "cf_status_thunderbird_esr60": "---", "creator_detail": {"email": "mcastelluccio@mozilla.com", "id": 420453, "name": "mcastelluccio@mozilla.com", "real_name": "Marco Castelluccio [:marco]"}, "whiteboard": "", "mentors": [], "summary": "Profile startup with most used antiviruses installed", "cf_has_str": "---", "alias": null, "dupe_of": null, "flags": [], "last_change_time": "2018-05-21T17:42:46Z", "assigned_to": "nobody@mozilla.org", "is_open": true, "history": [{"changes": [{"removed": "", "field_name": "cc", "added": "madperson@gmx.at"}], "who": "madperson@gmx.at", "when": "2018-02-15T16:26:47Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "past@mozilla.com"}, {"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(florian@queze.net)"}], "who": "past@mozilla.com", "when": "2018-03-01T17:00:23Z"}, {"changes": [{"removed": "needinfo?(florian@queze.net)", "field_name": "flagtypes.name", "added": ""}], "who": "florian@queze.net", "when": "2018-03-01T17:15:51Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "igoldan@mozilla.com, jmaher@mozilla.com, rwood@mozilla.com"}], "who": "jmaher@mozilla.com", "when": "2018-03-08T21:38:14Z"}, {"changes": [{"removed": "General", "field_name": "component", "added": "Startup and Profile System"}, {"removed": "Firefox", "field_name": "product", "added": "Toolkit"}], "who": "past@mozilla.com", "when": "2018-03-08T21:55:20Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "gijskruitbosch+bugs@gmail.com"}], "who": "gijskruitbosch+bugs@gmail.com", "when": "2018-03-14T15:29:44Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(mcastelluccio@mozilla.com)"}], "who": "past@mozilla.com", "when": "2018-03-14T22:46:47Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "rtestard@mozilla.com"}, {"removed": "needinfo?(mcastelluccio@mozilla.com)", "field_name": "flagtypes.name", "added": "needinfo?(rtestard@mozilla.com)"}], "who": "mcastelluccio@mozilla.com", "when": "2018-03-16T10:30:49Z"}, {"changes": [{"removed": "needinfo?(rtestard@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "rtestard@mozilla.com", "when": "2018-03-16T12:24:35Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(rtestard@mozilla.com)"}], "who": "jmaher@mozilla.com", "when": "2018-03-16T13:57:37Z"}, {"changes": [{"removed": "needinfo?(rtestard@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "rtestard@mozilla.com", "when": "2018-03-16T15:41:21Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(igoldan@mozilla.com)"}], "who": "jmaher@mozilla.com", "when": "2018-03-16T16:05:24Z"}, {"changes": [{"removed": "", "field_name": "whiteboard", "added": "[PI:March]"}], "who": "jmaher@mozilla.com", "when": "2018-03-16T16:11:12Z"}, {"changes": [{"removed": "nobody@mozilla.org", "field_name": "assigned_to", "added": "igoldan@mozilla.com"}], "who": "jmaher@mozilla.com", "when": "2018-03-19T17:41:26Z"}, {"changes": [{"removed": "needinfo?(igoldan@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "igoldan@mozilla.com", "when": "2018-03-20T14:54:00Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "mayankleoboy1@gmail.com"}], "who": "mayankleoboy1@gmail.com", "when": "2018-03-22T03:45:49Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(rtestard@mozilla.com)"}], "who": "igoldan@mozilla.com", "when": "2018-03-27T10:50:59Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(florian@queze.net)"}], "who": "jmaher@mozilla.com", "when": "2018-03-28T08:46:15Z"}, {"changes": [{"removed": "needinfo?(florian@queze.net)", "field_name": "flagtypes.name", "added": ""}], "who": "florian@queze.net", "when": "2018-03-28T11:03:34Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(mcastelluccio@mozilla.com)"}], "who": "igoldan@mozilla.com", "when": "2018-03-28T11:15:35Z"}, {"changes": [{"removed": "needinfo?(mcastelluccio@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "mcastelluccio@mozilla.com", "when": "2018-04-01T20:28:48Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "tgrabowski@mozilla.com"}, {"removed": "igoldan@mozilla.com", "field_name": "assigned_to", "added": "nobody@mozilla.org"}, {"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(tgrabowski@mozilla.com)"}], "who": "jmaher@mozilla.com", "when": "2018-04-04T08:49:28Z"}, {"changes": [{"removed": "[PI:March]", "field_name": "whiteboard", "added": ""}], "who": "jmaher@mozilla.com", "when": "2018-04-04T08:51:59Z"}, {"changes": [{"removed": "needinfo?(rtestard@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "rtestard@mozilla.com", "when": "2018-04-04T13:14:24Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "andrei.vaida@softvision.ro"}, {"removed": "needinfo?(tgrabowski@mozilla.com)", "field_name": "flagtypes.name", "added": "needinfo?(andrei.vaida@softvision.ro)"}], "who": "tgrabowski@mozilla.com", "when": "2018-04-06T17:00:16Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "cristian.baica@softvision.ro"}, {"removed": "needinfo?(andrei.vaida@softvision.ro)", "field_name": "flagtypes.name", "added": ""}], "who": "cristian.baica@softvision.ro", "when": "2018-04-26T06:18:36Z"}, {"changes": [{"removed": "--", "field_name": "priority", "added": "P3"}, {"removed": "", "field_name": "cc", "added": "paolo.mozmail@amadzone.org"}], "who": "paolo.mozmail@amadzone.org", "when": "2018-05-21T17:42:46Z"}], "resolution": "", "op_sys": "Unspecified", "cf_fx_points": "---", "cf_blocking_fennec": "---"}