{"cf_tracking_firefox60": "---", "cf_tracking_firefox61": "---", "classification": "Components", "creator": "victoria@mozilla.com", "mentors_detail": [], "depends_on": [], "creation_time": "2018-04-19T21:07:56Z", "cf_user_story": "", "cf_tracking_firefox_relnote": "---", "keywords": [], "summary": "Improve usability of docking options in new meatball menu", "cf_last_resolved": "2018-04-25T09:42:07Z", "attachments": [{"creator": "victoria@mozilla.com", "is_obsolete": 1, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8969428}, {"creator": "victoria@mozilla.com", "is_obsolete": 1, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8969432}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/png", "id": 8969526}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/png", "id": 8969565}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/png", "id": 8969566}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 1, "flags": [], "content_type": "text/plain", "id": 8970416}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 1, "flags": [], "content_type": "text/plain", "id": 8970417}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [{"status": "+", "name": "review", "modification_date": "2018-04-24T21:20:20Z", "type_id": 748, "creation_date": "2018-04-24T04:51:06Z", "id": 1748054, "setter": "jryans@gmail.com"}], "content_type": "text/x-review-board-request", "id": 8970418}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8970419}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8970420}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8970421}, {"creator": "bbirtles@mozilla.com", "is_obsolete": 0, "is_patch": 0, "flags": [], "content_type": "image/svg+xml", "id": 8970422}], "assigned_to_detail": {"email": "bbirtles@mozilla.com", "id": 165012, "name": "bbirtles@mozilla.com", "real_name": "Brian Birtles (:birtles)"}, "severity": "normal", "is_confirmed": true, "is_creator_accessible": true, "comments": [{"text": "Created attachment 8969428\nseparatewindow.svg\n\nAs shown in this updated mockup:\nhttps://mozilla.invisionapp.com/share/M5G8OO1ZVE4#/screens\n\n- Show all three docking options in their own menu section with icons, with check mark on currently selected.\n- The icons already exist in the project, but there's an updated separate window icon which I will attach to this bug.\n- The menu items for Split Console and Settings can be moved into their own menu section", "author": "victoria@mozilla.com", "id": 13219787, "time": "2018-04-19T21:07:56Z"}, {"text": "Created attachment 8969432\ndock-undock-expanded.svg\n\nOops, something was wrong with that previous icon. Attaching a new one", "author": "victoria@mozilla.com", "id": 13219796, "time": "2018-04-19T21:11:07Z"}, {"text": "Thanks Victoria! I started working on this yesterday. Currently fiddling with showing both checkmark and icon (normally we do one or the other).\n\nAlso not sure about the light coloring of the icons if we continue using OS native menu styling.", "author": "bbirtles@mozilla.com", "id": 13219894, "time": "2018-04-19T21:46:04Z"}, {"text": "Ah great, I just didn't want it to get lost :). Re: icon colors, makes sense to make them black or whatever the native color is. Can the svgs be filled to black in the code, or should I export new black icons?", "author": "victoria@mozilla.com", "id": 13219917, "time": "2018-04-19T21:52:20Z"}, {"text": "(In reply to Victoria Wang [:victoria] from comment #3)\n> Can the svgs be filled to black in the code, or should I export new black icons?\n\nYes, they can be filled in the code. I am filling them with the native menu text color (e.g. white for me on Ubuntu).", "author": "bbirtles@mozilla.com", "id": 13219981, "time": "2018-04-19T22:30:24Z"}, {"text": "https://treeherder.mozilla.org/#/jobs?repo=try&revision=4255833c92b02641a412818116e59411913e085e", "author": "bbirtles@mozilla.com", "id": 13220353, "time": "2018-04-20T01:24:12Z"}, {"text": "Created attachment 8969526\nUbuntu screenshot", "author": "bbirtles@mozilla.com", "id": 13220406, "time": "2018-04-20T02:19:24Z"}, {"text": "Updated attempt:\nhttps://treeherder.mozilla.org/#/jobs?repo=try&revision=9ea8a8a4f9ac3914b25613d7dbeb6fd03a917e3f\n\nWhat I discovered is that if we try to re-use the xul:image from iconic menu items we hit a whole raft of platform-specific issues. In particular, on Windows we need to make the image visible in the first place, then we discover that it uses an entirely different mapping of -moz-appearance values to Linux, and some of those -moz-appearance values trigger hard-coded padding values that we can't override from CSS.\n\nAfter trying this for a while I gave up and switched to using a background-image which avoids all platform-specific code and dependencies on effectively reversing rules in other (platform-specific) stylesheets.\n\nFor posterity, below is the first parts of the platform-specific CSS I started writing:\n\n> /*\n>  * Normally we don't use *both* a checkbox and an icon but in this menu, we do\n>  * so we need to fix each platform's behavior to allow both to be indented\n>  * correctly.\n>  *\n>  * The logic below is intended to mirror the logic in browser/themes/moz.build.\n>  */\n> \n> %ifdef MOZ_WIDGET_COCOA\n> /* TODO */\n> %endif\n> \n> %ifdef MOZ_WIDGET_GTK\n> /*\n>  * On Linux we want to match the margin-inline-start: 21px that is added to\n>  * .menu-text when we _don't_ have a checkbox / radiobox.\n>  */\n> #toolbox-meatball-menu .menuitem-iconic[type=\"checkbox\"] > .menu-iconic-left {\n>   /* This is (18 + the size of end-padding on .menu-iconic-left)px */\n>   padding-inline-start: 21px;\n> }\n> %endif\n> \n> %ifndef MOZ_WIDGET_COCOA\n> %ifndef MOZ_WIDGET_GTK\n> #toolbox-meatball-menu .menuitem-iconic[type=\"checkbox\"] > .menu-iconic-left {\n>   /* This doesn't actually work since we'll end up using the padding from\n>    * nsNativeThemeWin::GetWidgetPadding as triggered by -moz-appearance: menucheckbox;\n>    * which is a Windows-specific rule... */\n>   padding-inline-start: 1.45em !important;\n> }\n> \n> /* On Windows, .menu-icon-icon is set to display:none inside for checkbox/radio\n>  * menu items to avoid alignment issues with (see bug 411064). We don't have\n>  * that problem here so make sure to show the icon. */\n> #toolbox-meatball-menu > .menu-iconic-left > .menu-iconic-icon {\n>   display: -moz-box;\n> }\n> %endif\n> %endif\n> \n> #toolbox-meatball-menu-dock-bottom {\n>   list-style-image: var(--dock-bottom-image);\n> }\n> #toolbox-meatball-menu-dock-side:-moz-locale-dir(ltr) {\n>   list-style-image: var(--dock-side-right-image);\n> }\n> #toolbox-meatball-menu-dock-side:-moz-locale-dir(rtl) {\n>   list-style-image: var(--dock-side-left-image);\n> }\n> #toolbox-meatball-menu-dock-window {\n>   list-style-image: var(--dock-undock-image);\n> }", "author": "bbirtles@mozilla.com", "id": 13220594, "time": "2018-04-20T06:04:22Z"}, {"text": "Created attachment 8969565\nWindows screenshot", "author": "bbirtles@mozilla.com", "id": 13220672, "time": "2018-04-20T07:02:36Z"}, {"text": "Created attachment 8969566\nWindows RTL", "author": "bbirtles@mozilla.com", "id": 13220674, "time": "2018-04-20T07:04:10Z"}, {"text": "Looks like there is still some platform-specific styling going on here.\n\nOn OSX I get extra padding added. It's Friday afternoon here so I'm going to have to pick this up next week but I suspect I'll need to either:\n\n1) Drop the menu-iconic class and introduce a faux-iconic (inline-iconic?) that just does the background styles and skips all the extra XBL baggage that comes with menu-iconic.\n2) Add OSX-specific styling with %ifdef MOZ_WIDGET_COCOA to drop the (presumably) doubled padding.\n\nAlso, the other thing I need to fix here is that when the menu is first displayed the icons are missing. After hovering the menu they get read in an show up for the rest of the session. We need to preload those assets somehow. I'm not sure how we normally do that.", "author": "bbirtles@mozilla.com", "id": 13220732, "time": "2018-04-20T07:42:45Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #10)\n> Looks like there is still some platform-specific styling going on here.\n> \n> On OSX I get extra padding added. It's Friday afternoon here so I'm going to\n> have to pick this up next week but I suspect I'll need to either:\n> \n> 1) Drop the menu-iconic class and introduce a faux-iconic (inline-iconic?)\n> that just does the background styles and skips all the extra XBL baggage\n> that comes with menu-iconic.\n> 2) Add OSX-specific styling with %ifdef MOZ_WIDGET_COCOA to drop the\n> (presumably) doubled padding.\n\nIt turns out it's just that Mac sets the menu-left item to a fixed width of 16px so we should be able to override that without any platform-specific handling.\n\nRegarding adding inline-iconic, it turns out that doesn't really help since once we introduce type=\"checked\" we get menu-iconic anyway.", "author": "bbirtles@mozilla.com", "id": 13225950, "time": "2018-04-23T07:51:38Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #10)\n> Also, the other thing I need to fix here is that when the menu is first\n> displayed the icons are missing. After hovering the menu they get read in an\n> show up for the rest of the session. We need to preload those assets\n> somehow. I'm not sure how we normally do that.\n\nI'm a bit stuck about what forum to ask this in so I'm just CC'ing a few people who know front-end stuff.\n\nI've added a new menu to DevTools with SVG icons referenced by background-image. The problem is, when the menu is first opened the icons don't appear until you hover the menu. Presumably we need to preload them. I could try to reference them as offscreen background images from the button that triggers the menu. I see we do that elsehwere[1]. Or perhaps attach them to some other sprite sheet.[2] But is there some more general approach we normally use for this?\n\nI tried devtools slack but didn't get any response. I probably should try a more Firefox FE channel of some sort--where do Firefox front end people hang out?\n\n[1] e.g. https://reviewboard.mozilla.org/r/177990/diff/14#index_header\n[2] Bug 1191437", "author": "bbirtles@mozilla.com", "id": 13225952, "time": "2018-04-23T07:53:56Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #12)\n> (In reply to Brian Birtles (:birtles) from comment #10)\n> > Also, the other thing I need to fix here is that when the menu is first\n> > displayed the icons are missing. After hovering the menu they get read in an\n> > show up for the rest of the session. We need to preload those assets\n> > somehow. I'm not sure how we normally do that.\n> \n> I'm a bit stuck about what forum to ask this in so I'm just CC'ing a few\n> people who know front-end stuff.\n> \n> I've added a new menu to DevTools with SVG icons referenced by\n> background-image. The problem is, when the menu is first opened the icons\n> don't appear until you hover the menu. Presumably we need to preload them. I\n> could try to reference them as offscreen background images from the button\n> that triggers the menu. I see we do that elsehwere[1]. Or perhaps attach\n> them to some other sprite sheet.[2] But is there some more general approach\n> we normally use for this?\n\nIf the items only appear on hover then I'm pretty sure preloading isn't the issue. Something else is going wrong. If you check with the browser toolbox (https://developer.mozilla.org/en-US/docs/Tools/Browser_Toolbox - there's a button in there to not make menus/panels disappear as soon as focus changes), do the elements on which you're setting the background images have height and width before said images appear? Is there nothing overriding the style? Do you have webrender turned on, and if so do you see the same thing with it turned off?\n\n> I tried devtools slack but didn't get any response. I probably should try a\n> more Firefox FE channel of some sort--where do Firefox front end people hang\n> out?\n\n#devtools and #fx-team on IRC.\n\n\nFWIW, platform convention for checked items differ and on some platforms the convention is that icons aren't shown (ie you either get an icon, or you can have a checked/non-checked item, but not both). I'm not convinced that these items are so special that they need to not abide with those platform conventions, in which case you could just use the native support stuff and should basically be fine without much other CSS - but wouldn't get (any) icons on some platforms.", "author": "gijskruitbosch+bugs@gmail.com", "id": 13226106, "time": "2018-04-23T09:45:07Z"}, {"text": "Thank you!\n\n(In reply to :Gijs (he/him) from comment #13)\n> If the items only appear on hover then I'm pretty sure preloading isn't the\n> issue. Something else is going wrong.\n\nRight, that was my hunch too, but after the menu has been displayed once the icons show without a hitch from that point on. It's like the SVG graphic is not ready for the first paint and nothing triggers invalidation until the mouse is actually over the menu window.\n\n> If you check with the browser toolbox\n> (https://developer.mozilla.org/en-US/docs/Tools/Browser_Toolbox - there's a\n> button in there to not make menus/panels disappear as soon as focus\n> changes), do the elements on which you're setting the background images have\n> height and width before said images appear?\n\nYes.\n\n> Is there nothing overriding the style?\n\nNo.\n\n> Do you have webrender turned on\n\nNo.\n\n> > I tried devtools slack but didn't get any response. I probably should try a\n> > more Firefox FE channel of some sort--where do Firefox front end people hang\n> > out?\n> \n> #devtools and #fx-team on IRC.\n\nThank you!\n\n> FWIW, platform convention for checked items differ and on some platforms the\n> convention is that icons aren't shown (ie you either get an icon, or you can\n> have a checked/non-checked item, but not both). I'm not convinced that these\n> items are so special that they need to not abide with those platform\n> conventions, in which case you could just use the native support stuff and\n> should basically be fine without much other CSS - but wouldn't get (any)\n> icons on some platforms.\n\nRight. Let me follow up with Victoria about this. Thanks again.", "author": "bbirtles@mozilla.com", "id": 13226296, "time": "2018-04-23T12:08:39Z"}, {"text": "Victoria, do we need both checkmarks and icons? Gijs points out in comment 12 that on some platforms (most platforms as far as I can tell) don't generally show both a checkmark and icon for a menu item.\n\nWould it make sense, for example, to show the icons and highlight the selected one with the highlight color?", "author": "bbirtles@mozilla.com", "id": 13226300, "time": "2018-04-23T12:12:34Z"}, {"text": "It seems native enough for MacOS - it's in three places in Settings > General (e.g. Default Web Browser), and I also see it in the print dialog (printer disconnection icon). The pattern of a menu item with both check mark and icon seems pretty straightforward to me (I see the icon as part of the name of the menu item), and it would improve usability of the menu, so I would suggest that it still seems worth doing this in all the platforms, as long as it's not getting too hairy to implement. The highlight color seems less native to me (at least for MacOS) and would be a bit worse for accessibility.", "author": "victoria@mozilla.com", "id": 13228174, "time": "2018-04-24T00:30:43Z"}, {"text": "(In reply to Victoria Wang [:victoria] from comment #16)\n> It seems native enough for MacOS\n\nSure, but not on Windows or Linux.\n\n> The pattern of a menu item with both check\n> mark and icon seems pretty straightforward to me (I see the icon as part of\n> the name of the menu item), and it would improve usability of the menu, so I\n> would suggest that it still seems worth doing this in all the platforms, as\n> long as it's not getting too hairy to implement. The highlight color seems\n> less native to me (at least for MacOS) and would be a bit worse for\n> accessibility.\n\nThe \"gutter\" that on Windows (and apparently Linux) shares check state / icon state is native there, and from the comments so far, implementing checkmark + icon on Windows/Linux seems pretty hairy to me.\n\nI can't think of anything else in Firefox that shows checkmarks as well as icons in a native menu on Windows / Linux. The only thing that breaks this rule is the sidebar dropdown, which is (a) new and (b) not a native menu (it's a panel instead of a menu).", "author": "gijskruitbosch+bugs@gmail.com", "id": 13228181, "time": "2018-04-24T00:38:54Z"}, {"text": "(In reply to :Gijs (he/him) from comment #17)\n> The \"gutter\" that on Windows (and apparently Linux) shares check state /\n> icon state is native there, and from the comments so far, implementing\n> checkmark + icon on Windows/Linux seems pretty hairy to me.\n\nI'm not yet sure if the issues I'm seeing are actually a result of the extra work needed to support both checkmark + icon. I'm starting to wonder if it's related to the way we initialize the menu in devtools/client/framework/menu.js (and perhaps we've never noticed because so far I can't find anywhere else in devtools we use icons in popup menus?).", "author": "bbirtles@mozilla.com", "id": 13228233, "time": "2018-04-24T01:02:24Z"}, {"text": "I checked this out on Windows 7 and I can see why this might be tricky. The gutter is outlined and one width only, so when there's an icon in there, checked state is shown as bolded text or a bonus tiny green check icon superimposed on the other icon.\n\nIn any case, if it seems like the difficulty of making this UI happen might block this issue from landing in 61 (or get in the way of other more important work), I think leaving the icons out for now and using just the checkboxes would be fine.\n\nFor the future, however, I think it could be worth implementing the custom UI based on the sidebar dropdown panel. It would match the main Firefox meatball menu which uses one of these custom panels too.", "author": "victoria@mozilla.com", "id": 13228238, "time": "2018-04-24T01:04:38Z"}, {"text": "(In reply to Victoria Wang [:victoria] from comment #19)\n> For the future, however, I think it could be worth implementing the custom\n> UI based on the sidebar dropdown panel. It would match the main Firefox\n> meatball menu which uses one of these custom panels too.\n\nDoing something like that sidebar dropdown panel sounds like a good idea. It seems like it would fit better with the rest of Firefox UI and give us more flexibility too. If you have a chance to update the mockup then perhaps we can take that on in 62? Perhaps we could restore the split console icon too.", "author": "bbirtles@mozilla.com", "id": 13228257, "time": "2018-04-24T01:16:33Z"}, {"text": "Created attachment 8970416\nAdd icons to meatball menu\n\nI'm adding the patches for the icons here for posterity since it seems like we won't need them in this bug. I spent quite a bit of time cleaning up the SVGs so hopefully we can use them in the follow-up bug.", "author": "bbirtles@mozilla.com", "id": 13228576, "time": "2018-04-24T04:45:52Z"}, {"text": "Created attachment 8970417\nMake RTL version of dock to side icon", "author": "bbirtles@mozilla.com", "id": 13228578, "time": "2018-04-24T04:46:56Z"}, {"text": "(Don't trust splinter for that last patch--you need to check the actual patch file to see how it uses `hg cp` to understand what is going on.)", "author": "bbirtles@mozilla.com", "id": 13228580, "time": "2018-04-24T04:47:57Z"}, {"text": "Created attachment 8970418\nBug 1455443 - Convert dock menu options to a checkbox list;\n\nThis also fixes the grouping so that the checkboxes appear before the separator\nas per the mockup here:\n\n  https://mozilla.invisionapp.com/share/M5G8OO1ZVE4#/screens\n\nReview commit: https://reviewboard.mozilla.org/r/239194/diff/#index_header\nSee other reviews: https://reviewboard.mozilla.org/r/239194/", "author": "bbirtles@mozilla.com", "id": 13228582, "time": "2018-04-24T04:51:06Z"}, {"text": "https://treeherder.mozilla.org/#/jobs?repo=try&revision=8158da021838023934facfae34acb7928a97f4fe", "author": "bbirtles@mozilla.com", "id": 13228583, "time": "2018-04-24T04:51:25Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #25)\n> https://treeherder.mozilla.org/#/\n> jobs?repo=try&revision=8158da021838023934facfae34acb7928a97f4fe\n\nOops. I should have used an artifact build for that. Try again:\n\nhttps://treeherder.mozilla.org/#/jobs?repo=try&revision=71414ac876c1bdb6be209988352607f3799f51a9", "author": "bbirtles@mozilla.com", "id": 13228585, "time": "2018-04-24T04:54:11Z"}, {"text": "Created attachment 8970419\ndock-bottom.svg", "author": "bbirtles@mozilla.com", "id": 13228586, "time": "2018-04-24T04:55:28Z"}, {"text": "Created attachment 8970420\ndock-side-left.svg", "author": "bbirtles@mozilla.com", "id": 13228588, "time": "2018-04-24T04:55:49Z"}, {"text": "Created attachment 8970421\ndock-side-right.svg", "author": "bbirtles@mozilla.com", "id": 13228589, "time": "2018-04-24T04:56:05Z"}, {"text": "Created attachment 8970422\ndock-undock.svg", "author": "bbirtles@mozilla.com", "id": 13228590, "time": "2018-04-24T04:56:26Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #26)\n> Oops. I should have used an artifact build for that. Try again:\n> \n> https://treeherder.mozilla.org/#/jobs?repo=try&revision=71414ac876c1bdb6be209988352607f3799f51a9\n\nVictoria, please take a look at Brian's changes.\n\nIf you have a local checkout, you can use `./mach mozregression --launch 71414ac876c1bdb6be209988352607f3799f51a9 --repo try` to automate downloading and launching it.\n\nOtherwise, you can also download a build from:\n\nhttps://queue.taskcluster.net/v1/task/Q_41M6fRS3avRZYE_QnKpg/runs/0/artifacts/public/build/target.dmg", "author": "jryans@gmail.com", "id": 13230931, "time": "2018-04-24T21:19:34Z"}, {"text": "Comment on attachment 8970418\nBug 1455443 - Convert dock menu options to a checkbox list;\n\nhttps://reviewboard.mozilla.org/r/239194/#review245174\n\nThanks for working on this! :) The code changes look reasonable to me.\n\nI added a need info for Victoria to review the UX.\n\n::: devtools/client/framework/components/toolbox-controller.js:28\n(Diff revision 1)\n>        focusedButton: ELEMENT_PICKER_ID,\n>        toolboxButtons: [],\n>        currentToolId: null,\n>        highlightedTools: new Set(),\n>        panelDefinitions: [],\n> +      hostType: undefined,\n\nMaybe rename to `currentHostType` or `selectedHostType` throughout this patch?\n\nI find it a bit jarring to see both `hostType` and `hostTypes` in the same module with different meanings for each.\n\n::: devtools/client/framework/components/toolbox-toolbar.js:350\n(Diff revision 1)\n>    }\n>  ) {\n>    const menu = new Menu({ id: \"toolbox-meatball-menu\" });\n>  \n>    // Dock options\n> -  for (const hostType of hostTypes) {\n> +  for (const thisHostType of hostTypes) {\n\nChange the name of the state as suggested would also allow reverting this name change.\n\n::: devtools/client/locales/en-US/toolbox.properties:154\n(Diff revision 1)\n>  # LOCALIZATION NOTE (toolbox.meatballMenu.dock.*.label): These labels are shown\n>  # in the \"...\" menu in the toolbox and represent the different arrangements for\n>  # docking (or undocking) the developer tools toolbox.\n>  toolbox.meatballMenu.dock.bottom.label=Dock to bottom\n>  toolbox.meatballMenu.dock.side.label=Dock to side\n> -toolbox.meatballMenu.dock.window.label=Undock\n> +toolbox.meatballMenu.dock.separateWindow.label=Separate window\n\nMockup shows a capital \"W\" on window... I am never sure what's correct, but it seems like what you have matches other entries.", "author": "jryans@gmail.com", "id": 13230935, "time": "2018-04-24T21:20:20Z"}, {"text": "(In reply to Brian Birtles (:birtles) from comment #20)\n> (In reply to Victoria Wang [:victoria] from comment #19)\n> > For the future, however, I think it could be worth implementing the custom\n> > UI based on the sidebar dropdown panel. It would match the main Firefox\n> > meatball menu which uses one of these custom panels too.\n> \n> Doing something like that sidebar dropdown panel sounds like a good idea. It\n> seems like it would fit better with the rest of Firefox UI and give us more\n> flexibility too. If you have a chance to update the mockup then perhaps we\n> can take that on in 62? Perhaps we could restore the split console icon too.\n\nSounds good! Wrote myself a note to update the mockup with the custom panel with images for 62.\n\n(In reply to J. Ryan Stinnett [:jryans] (use ni?) from comment #31)\n> (In reply to Brian Birtles (:birtles) from comment #26)\n> > Oops. I should have used an artifact build for that. Try again:\n> > \n> > https://treeherder.mozilla.org/#/jobs?repo=try&revision=71414ac876c1bdb6be209988352607f3799f51a9\n> \n> Victoria, please take a look at Brian's changes.\n\nThanks, it looks good to me!", "author": "victoria@mozilla.com", "id": 13231026, "time": "2018-04-24T21:48:37Z"}, {"text": "Comment on attachment 8970418\nBug 1455443 - Convert dock menu options to a checkbox list;\n\nReview request updated; see interdiff: https://reviewboard.mozilla.org/r/239194/diff/1-2/", "author": "bbirtles@mozilla.com", "id": 13231479, "time": "2018-04-25T00:48:57Z"}, {"text": "Pushed by bbirtles@mozilla.com:\nhttps://hg.mozilla.org/integration/autoland/rev/d95bd7ea668b\nConvert dock menu options to a checkbox list; r=jryans", "author": "pulsebot@bots.tld", "id": 13231487, "time": "2018-04-25T00:53:43Z"}, {"text": "https://hg.mozilla.org/mozilla-central/rev/d95bd7ea668b", "author": "rgurzau@mozilla.com", "id": 13232036, "time": "2018-04-25T09:42:07Z"}, {"text": "I have reproduced this issue using Firefox 61.0a1 (2017.03.07) on Ubuntu 14.04 x64.\nI can confirm this issue is fixed, I verified using Firefox 61.0b10 on Win 10 x64, Mac OS X 10.13 and Ubuntu 14.04 x64.", "author": "timea.zsoldos@softvision.ro", "id": 13385073, "time": "2018-06-04T13:21:19Z"}], "id": 1455443, "priority": "--", "platform": "Unspecified", "comment_count": 38, "version": "unspecified", "is_cc_accessible": true, "cf_tracking_firefox_esr52": "---", "cf_tracking_firefox62": "---", "status": "VERIFIED", "product": "DevTools", "cf_fx_iteration": "---", "blocks": [1444299, 1461522], "qa_contact": "", "see_also": [], "cf_status_firefox_esr52": "---", "component": "General", "votes": 0, "cf_tracking_firefox_esr60": "---", "cf_status_firefox62": "---", "cf_status_firefox61": "verified", "cf_status_firefox60": "---", "target_milestone": "Firefox 61", "cc": ["bbirtles@mozilla.com", "gijskruitbosch+bugs@gmail.com", "jaws@mozilla.com", "jdescottes@mozilla.com", "jryans@gmail.com", "mstange@themasta.com", "nchevobbe@mozilla.com", "timea.zsoldos@softvision.ro", "victoria@mozilla.com"], "groups": [], "url": "", "creator_detail": {"email": "victoria@mozilla.com", "id": 598209, "name": "victoria@mozilla.com", "real_name": "Victoria Wang [:victoria]"}, "whiteboard": "", "mentors": [], "cc_detail": [{"email": "bbirtles@mozilla.com", "id": 165012, "name": "bbirtles@mozilla.com", "real_name": "Brian Birtles (:birtles)"}, {"email": "gijskruitbosch+bugs@gmail.com", "id": 159069, "name": "gijskruitbosch+bugs@gmail.com", "real_name": ":Gijs (he/him)"}, {"email": "jaws@mozilla.com", "id": 409754, "name": "jaws@mozilla.com", "real_name": "Jared Wein [:jaws] (please needinfo? me)"}, {"email": "jdescottes@mozilla.com", "id": 559949, "name": "jdescottes@mozilla.com", "real_name": "Julian Descottes [:jdescottes][:julian]"}, {"email": "jryans@gmail.com", "id": 282978, "name": "jryans@gmail.com", "real_name": "J. Ryan Stinnett [:jryans] (use ni?)"}, {"email": "mstange@themasta.com", "id": 293943, "name": "mstange@themasta.com", "real_name": "Markus Stange [:mstange]"}, {"email": "nchevobbe@mozilla.com", "id": 557153, "name": "nchevobbe@mozilla.com", "real_name": "Nicolas Chevobbe [:nchevobbe]"}, {"email": "timea.zsoldos@softvision.ro", "id": 586868, "name": "timea.zsoldos@softvision.ro", "real_name": "Timea Zsoldos [:zstimi/tzsoldos], Desktop Release QA"}, {"email": "victoria@mozilla.com", "id": 598209, "name": "victoria@mozilla.com", "real_name": "Victoria Wang [:victoria]"}], "alias": null, "dupe_of": null, "flags": [], "last_change_time": "2018-06-13T17:21:13Z", "cf_status_firefox_esr60": "---", "assigned_to": "bbirtles@mozilla.com", "is_open": false, "cf_qa_whiteboard": "", "resolution": "FIXED", "op_sys": "Unspecified", "cf_fx_points": "---", "history": [{"changes": [{"field_name": "attachments.isobsolete", "removed": "0", "attachment_id": 8969428, "added": "1"}], "who": "victoria@mozilla.com", "when": "2018-04-19T21:11:07Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "bbirtles@mozilla.com"}], "who": "victoria@mozilla.com", "when": "2018-04-19T21:11:35Z"}, {"changes": [{"removed": "NEW", "field_name": "status", "added": "ASSIGNED"}, {"removed": "", "field_name": "blocks", "added": "1444299"}, {"removed": "nobody@mozilla.org", "field_name": "assigned_to", "added": "bbirtles@mozilla.com"}], "who": "bbirtles@mozilla.com", "when": "2018-04-19T22:35:18Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "gijskruitbosch+bugs@gmail.com, jaws@mozilla.com, jdescottes@mozilla.com, jryans@gmail.com, mstange@themasta.com, nchevobbe@mozilla.com"}], "who": "bbirtles@mozilla.com", "when": "2018-04-23T07:53:56Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(victoria@mozilla.com)"}], "who": "bbirtles@mozilla.com", "when": "2018-04-23T12:12:34Z"}, {"changes": [{"removed": "", "field_name": "cc", "added": "victoria@mozilla.com"}, {"removed": "needinfo?(victoria@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "victoria@mozilla.com", "when": "2018-04-24T00:30:43Z"}, {"changes": [{"field_name": "flagtypes.name", "removed": "", "attachment_id": 8970418, "added": "review?(jryans@gmail.com)"}], "who": "bbirtles@mozilla.com", "when": "2018-04-24T04:51:06Z"}, {"changes": [{"field_name": "attachments.isobsolete", "removed": "0", "attachment_id": 8969432, "added": "1"}], "who": "bbirtles@mozilla.com", "when": "2018-04-24T04:56:26Z"}, {"changes": [{"removed": "", "field_name": "flagtypes.name", "added": "needinfo?(victoria@mozilla.com)"}], "who": "jryans@gmail.com", "when": "2018-04-24T21:19:34Z"}, {"changes": [{"field_name": "flagtypes.name", "removed": "review?(jryans@gmail.com)", "attachment_id": 8970418, "added": "review+"}], "who": "jryans@gmail.com", "when": "2018-04-24T21:20:20Z"}, {"changes": [{"removed": "needinfo?(victoria@mozilla.com)", "field_name": "flagtypes.name", "added": ""}], "who": "victoria@mozilla.com", "when": "2018-04-24T21:48:37Z"}, {"changes": [{"removed": "ASSIGNED", "field_name": "status", "added": "RESOLVED"}, {"removed": "", "field_name": "resolution", "added": "FIXED"}, {"removed": "---", "field_name": "target_milestone", "added": "Firefox 61"}, {"removed": "", "field_name": "cf_last_resolved", "added": "2018-04-25 09:42:07"}, {"removed": "---", "field_name": "cf_status_firefox61", "added": "fixed"}], "who": "rgurzau@mozilla.com", "when": "2018-04-25T09:42:07Z"}, {"changes": [{"removed": "", "field_name": "blocks", "added": "1461522"}], "who": "bbirtles@mozilla.com", "when": "2018-05-14T23:44:04Z"}, {"changes": [{"removed": "RESOLVED", "field_name": "status", "added": "VERIFIED"}, {"removed": "", "field_name": "cc", "added": "timea.zsoldos@softvision.ro"}, {"removed": "fixed", "field_name": "cf_status_firefox61", "added": "verified"}], "who": "timea.zsoldos@softvision.ro", "when": "2018-06-04T13:21:19Z"}, {"changes": [{"removed": "Firefox", "field_name": "product", "added": "DevTools"}], "who": "automation@bmo.tld", "when": "2018-06-13T17:21:13Z"}]}